12/data/attachments/a30506000bb698b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Michael_he_Friend_24929_0</nif:username>
            <nif:friendToBeRequested>soap_friends_cd858865-2cf8-4dd2-bca7-fd02ca950a17</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>